[
	{
		"authors": "Srisongkram, T., Khamtang, P., & Weerapreeyakul, N.",
		"year": 2023,
		"title": "Prediction of KRASG12C inhibitors using conjoint fingerprint and machine learning-based QSAR models.",
		"journal": "Journal of Molecular Graphics and Modelling, 122, 108466."
	},
	{
		"authors": "So, V., Poul, P., Oeung, S., Srey, P., Mao, K., Ung, H., Eng, P., Heim, M., Srun, M., Chheng, C., Chea, S., Srisongkram, T., & Weerapreeyakul, N.",
		"year": 2023,
		"title": "Bioactive Compounds, Antioxidant Activities, and HPLC Analysis of Nine Edible Sprouts in Cambodia.",
		"journal": "Molecules, 28(6), Article 6."
	},
	{
		"authors": "Ratha J, Yongram C, Panyatip P, Powijitkul P, Siriparu P, Datham S, Priprem A, Srisongkram T, Puthongking P.",
		"year": 2023,
		"title": "Polyphenol and Tryptophan Contents of Purple Corn (Zea mays L.) Variety KND and Butterfly Pea (Clitoria ternatea) Aqueous Extracts: Insights into Phytochemical Profiles with Antioxidant Activities and PCA Analysis.",
		"journal": "Plants. 2023; 12(3):603."
	},
	{
		"authors": "Srisongkram T, Weerapreeyakul N.",
		"year": 2023,
		"title": "Drug Repurposing against KRAS Mutant G12C: A Machine Learning, Molecular Docking, and Molecular Dynamics Study.",
		"journal": "International Journal of Molecular Sciences. 2023; 24(1):669"
	},
	{
		"authors": "Siriparu P, Panyatip P, Pota T, Ratha J, Yongram C, Srisongkram T, Sungthong B, Puthongking P.",
		"year": 2022,
		"title": "Effect of Germination and Illumination on Melatonin and Its Metabolites, Phenolic Content, and Antioxidant Activity in Mung Bean Sprouts.",
		"journal": "Plants. 2022 Nov 6;11(21):2990."
	},
	{
		"authors": "Juengsanguanpornsuk W, Kitisripanya T, Boonsnongcheep P, Yusakul G, Srisongkram T, Sakamoto S, Putalun W.",
		"year": 2022,
		"title": "Improvement in the binding specificity of anti-isomiroestrol antibodies by expression as fragments under oxidizing conditions inside the SHuffle T7 E. coli cytoplasm.",
		"journal": "Bioscience, Biotechnology, and Biochemistry. 2022 Oct;86(10):1368-77."
	},
	{
		"authors": "Srisongkram T, Bahrami K, Järvinen J, Timonen J, Rautio J, Weerapreeyakul N.",
		"year": 2022,
		"title": "Development of Sesamol Carbamate-L-Phenylalanine Prodrug Targeting L-Type Amino Acid Transporter1 (LAT1) as a Potential Antiproliferative Agent against Melanoma.",
		"journal": "International Journal of Molecular Sciences. 2022 Jul 30;23(15):8446."
	},
	{
		"authors": "Srisongkram T, Weerapreeyakul N.",
		"year": 2022,
		"title": "Route of intracellular uptake and cytotoxicity of sesamol, sesamin, and sesamolin in human melanoma SK-MEL-2 cells.",
		"journal": "Biomedicine & Pharmacotherapy. 2022 Feb 1; 146:112528."
	},
	{
		"authors": "Srisongkram T, Waithong S, Thitimetharoch T, Weerapreeyakul N.",
		"year": 2022,
		"title": "Machine learning and in vitro chemical screening of potential α-amylase and α-glucosidase inhibitors from Thai indigenous plants.",
		"journal": "Nutrients. 2022 Jan 9;14(2):267."
	},
	{
		"authors": "Srisongkram T, Weerapreeyakul N, Thumanu K.",
		"year": 2020,
		"title": "Evaluation of Melanoma (SK-MEL-2) Cell Growth between Three-Dimensional (3D) and Two-Dimensional (2D) Cell Cultures with Fourier Transform Infrared (FTIR) Microspectroscopy.",
		"journal": "International Journal of Molecular Sciences. 2020; 21(11):4141."
	},
	{
		"authors": "Srisongkram T, Weerapreeyakul N, Kärkkäinen J, Rautio J.",
		"year": 2019,
		"title": "Role of L-Type Amino Acid Transporter 1 (LAT1) for the Selective Cytotoxicity of Sesamol in Human Melanoma Cells.",
		"journal": "Molecules. 2019; 24(21):3869."
	},
	{
		"authors": "Srisongkram T, Weerapreeyakul N.",
		"year": 2019,
		"title": "Validation of Cell-Based Assay for Quantification of Sesamol Uptake and Its Application for Measuring Target Exposure.",
		"journal": "Molecules. 2019; 24(19):3522."
	}

]